TexasInstruments-Sandbox/simplelink-wifi-demos/projects/LP_EM_CC35X1/azure-iot-mqtt/freertos/aziot_client_app.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --board "/ti/boards/LP_EM_CC35X1" --rtos "freertos" --product "simplelink_wifi_sdk@9.22.00.11" --product "TOOLBOX@4.1.8"
 * @v2CliArgs --board "/ti/boards/LP_EM_CC35X1" --rtos "freertos" --product "simplelink_wifi_sdk@9.22.00.11" --product "TOOLBOX@4.1.8"
 * @versions {"tool":"1.26.1+4432"}
 */

/**
 * Import the modules used in this configuration.
 */
const FreeRTOS              = scripting.addModule("/freertos/FreeRTOS");
const CryptoKeyKeyStore_PSA = scripting.addModule("/ti/drivers/CryptoKeyKeyStore_PSA");
const GPIO                  = scripting.addModule("/ti/drivers/GPIO");
const I2C                   = scripting.addModule("/ti/drivers/I2C", {}, false);
const I2C1                  = I2C.addInstance();
const Power                 = scripting.addModule("/ti/drivers/Power");
const UART2                 = scripting.addModule("/ti/drivers/UART2");
const UART21                = UART2.addInstance();
const UART22                = UART2.addInstance();
const Button                = scripting.addModule("/ti/drivers/apps/Button", {}, false);
const Button1               = Button.addInstance();
const Button2               = Button.addInstance();
const LED                   = scripting.addModule("/ti/drivers/apps/LED", {}, false);
const LED1                  = LED.addInstance();
const LED2                  = LED.addInstance();
const LED3                  = LED.addInstance();
const Mem_cfg               = scripting.addModule("/ti/memoryconfig/MemoryConfigurator/Mem_cfg");
const Settings              = scripting.addModule("/ti/posix/freertos/Settings");
const wifi                  = scripting.addModule("/ti/rfstacks/wifi/wifi");

/**
 * Write custom configuration values to the imported modules.
 */
FreeRTOS.useTimeSlicing       = true;
FreeRTOS.idleStackSize        = 0x00001000;
FreeRTOS.timerStackSize       = 0x00001000;
FreeRTOS.posixThreadStackSize = 0x00001000;
FreeRTOS.heapSize             = 0x00047FF0;

I2C1.$name              = "CONFIG_I2C_0";
I2C1.i2c.$assign        = "I2C1";
I2C1.i2c.sdaPin.$assign = "boosterpack.5";
I2C1.i2c.sclPin.$assign = "boosterpack.6";

UART21.$name                     = "CONFIG_UART2_0";
UART21.$hardware                 = system.deviceData.board.components.XDS110UART;
UART21.uart.dmaTxChannel.$assign = "DMA_CH2";
UART21.uart.dmaRxChannel.$assign = "DMA_CH3";

UART22.$name = "CONFIG_UART2_1";

Button1.$name          = "CONFIG_BUTTON_SW1";
Button1.button.$assign = "boosterpack.19";

Button2.$name          = "CONFIG_BUTTON_SW2";
Button2.button.$assign = "boosterpack.40";

LED1.$hardware = system.deviceData.board.components.LED_GREEN;
LED1.$name     = "CONFIG_LED_GREEN";

LED2.$hardware = system.deviceData.board.components.LED_BLUE;
LED2.$name     = "CONFIG_LED_BLUE";

LED3.$hardware      = system.deviceData.board.components.LED_RED;
LED3.$name          = "CONFIG_LED_RED";
LED3.ledPin.$assign = "boosterpack.31";

Mem_cfg.flash_device_type = "IS25WJ032F";
Mem_cfg.ota               = false;

wifi.XTAL_SettlingTime = 0x2EE0;
wifi.WakeUpEvent       = 2;
wifi.ListenInterval    = 3;
wifi.PowerSaveScheme   = 1;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
UART21.uart.$suggestSolution              = "UART1";
UART21.uart.txPin.$suggestSolution        = "GPIO5";
UART21.uart.rxPin.$suggestSolution        = "GPIO6";
UART22.uart.$suggestSolution              = "UART0";
UART22.uart.dmaTxChannel.$suggestSolution = "DMA_CH1";
UART22.uart.dmaRxChannel.$suggestSolution = "DMA_CH0";
UART22.uart.txPin.$suggestSolution        = "boosterpack.4";
UART22.uart.rxPin.$suggestSolution        = "boosterpack.3";
LED1.ledPin.$suggestSolution              = "boosterpack.17";
LED2.ledPin.$suggestSolution              = "boosterpack.36";
